const timeline = [
  {
    id: 7,
    date: '2024-09-23',
    title: 'Купил себе ноутбук! Honor 16 Pro',
    description:
      'Мне так трудно покупать что-то себе, боюсь брать ответственность за трату своих же денег. Но в этот раз я решился! Может быть это начало чего-то нового',
  },
  {
    id: 6,
    date: '2024-09-19',
    title: 'Начал вести Timeline своих достижений',
    url: 'https://simagames.ru/timeline',
    description:
      'Иногда подводил итоги года, и это доставляло столько эмоций! В целом, видеть, что ты к чему-то движешься, очень полезно и поднимает настроение. Поэтому хочу начать вести таймлайн своей жизни',
  },
  {
    id: 5,
    date: '2024-09-16',
    title: 'Запустил сайт simagames.ru',
    url: 'https://simagames.ru',
    description:
      'Всегда такой хотел! Буду здесь вести свое портфолио, (возможно) блог, таймлайн своих достижений, и кто знает что еще...',
  },
  {
    id: 4,
    date: '2024-08-31',
    title: 'Написал книжку по программированию',
    description:
      'Создай свою игру на Python. Книжка-комикс. Мне тяжело доводить проекты до конца, часто бросаю отвлекаясь на что-то новое. Но это чудо, которое все меняет. Этот проект менялся и менял меня 2 года',
  },
  {
    id: 3,
    date: '2024-08-22',
    title: 'Начал бегать каждый день',
    url: 'https://www.youtube.com/shorts/LE0CKQoGJqs',
    description:
      'Увидел на YouTube блогера, который бегает каждый день. Как вы понимаете, я сильно им вдохновился. Теперь тоже каждый день бегаю и делаю короткий ролик с пробежки',
  },
  {
    id: 2,
    date: '2024-08-21',
    title: 'Запустил YouTube канал с ежедневными влогами',
    url: 'https://www.youtube.com/@%D1%81%D0%B5%D1%80%D0%B0%D1%84%D0%B8%D0%BC%D0%BA%D0%B2%D0%B0%D1%88%D0%BD%D0%B8%D0%BD',
    description:
      'Хочу уделять больше внимания своему жизненному пути. Для меня такой формат легче текстового дневника, но при этом хорошо помогает подводить итоги дня',
  },
  {
    id: 1,
    date: '2024-02-13',
    title: 'Возобновил бег спустя 10 лет',
    description:
      'Занимался легкой атлетикой, но не получал от этого удовольствия. Просто спорт и социальная движуха с друзьями. Решил подойти к этому вопросу со стороны настроения и оздоровления. Начал бегать аккуратно, следя за самочувствием',
  },
];

const getTimeline = () => timeline;

export { getTimeline };
